# Assignment - 1

## Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

In [2]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'

In [3]:
columns = ['user_id','age','gender','occupation','zip_code']
df = pd.read_csv(url, sep='|',names = columns)

In [4]:
df.head()

   user_id  age  gender  occupation  zip_code
0  user_id  age  gender  occupation  zip_code
1        1   24       M  technician     85711
2        2   53       F       other     94043
3        3   23       M      writer     32067
4        4   24       M  technician     43537

In [5]:
df.drop([0],axis=0,inplace=True)

In [6]:
df['user_id'] = df['user_id'].astype('int64')
df['age'] = df['age'].astype('int64')

## See the first 10 and last 10 entries

In [7]:
print('The first 10 records')
print(df.head(10))
print('\n\nThe last 10 records')
print(df.tail(10))

The first 10 records
    user_id  age gender     occupation zip_code
1         1   24      M     technician    85711
2         2   53      F          other    94043
3         3   23      M         writer    32067
4         4   24      M     technician    43537
5         5   33      F          other    15213
6         6   42      M      executive    98101
7         7   57      M  administrator    91344
8         8   36      M  administrator    05201
9         9   29      M        student    01002
10       10   53      M         lawyer    90703


The last 10 records
     user_id  age gender     occupation zip_code
934      934   61      M       engineer    22902
935      935   42      M         doctor    66221
936      936   24      M          other    32789
937      937   48      M       educator    98072
938      938   38      F     technician    55038
939      939   26      F        student    33319
940      940   32      M  administrator    02215
941      941   20      M        student    97229
942      942   48      F      librarian    78209
943      943   22      M        student    77841

## What is the number of observations in the dataset?

In [8]:
print('Number of observations : ',df.shape[0])

Number of observations :  943

## What is number of columns in dataset?

In [9]:
print('Number of columns : ',df.shape[1])

Number of columns :  5

## Print the name of all the columns.

In [10]:
df.columns

Index(['user_id', 'age', 'gender', 'occupation', 'zip_code'], dtype='object')

## What is the data type of each column?

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     943 non-null    int64
 1   age         943 non-null    int64
 2   gender      943 non-null    object
 3   occupation  943 non-null    object
 4   zip_code    943 non-null    object
dtypes: int64(2), object(3)
memory usage: 44.2+ KB

## Print only the occupation column

In [12]:
df['occupation']

1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

## How many different occupations are in this dataset?

In [13]:
df['occupation'].unique()

array(['technician', 'other', 'writer', 'executive', 'administrator',
       'student', 'lawyer', 'educator', 'scientist', 'entertainment',
       'programmer', 'librarian', 'homemaker', 'artist', 'engineer',
       'marketing', 'none', 'healthcare', 'retired', 'salesman', 'doctor'],
      dtype=object)

In [14]:
df['occupation'].nunique()

21

## What is the most frequent occupation?

In [15]:
df['occupation'].mode()

0    student
dtype: object

## DataFrame Info.

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     943 non-null    int64
 1   age         943 non-null    int64
 2   gender      943 non-null    object
 3   occupation  943 non-null    object
 4   zip_code    943 non-null    object
dtypes: int64(2), object(3)
memory usage: 44.2+ KB

## Describe all the columns

In [17]:
df.describe()

          user_id         age
count  943.000000  943.000000
mean   472.000000   34.051962
std    272.364951   12.192740
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

## Summarize only the occupation column

In [18]:
df['occupation'].value_counts()

student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
lawyer            12
salesman          12
none               9
homemaker          7
doctor             7
Name: occupation, dtype: int64

## What is the mean age of users?

In [19]:
df['age'].mean()

34.05196182396607

## What is the age with least occurrence?

In [20]:
df['age'].min()

7